# IsValidCurveLoop Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiSegmentGrid..::..IsValidCurveLoop Method
MultiSegmentGrid Class See Also
---
Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsValidCurveLoop(
	CurveLoop curveLoop
)
```

Visual Basic
---
```text
Public Shared Function IsValidCurveLoop ( _
	curveLoop As CurveLoop _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidCurveLoop(
	CurveLoop^ curveLoop
)
```

# ### Parameters
curveLoop
    Type: Autodesk.Revit.DB..::..CurveLoop The curve loop.
# ### Return Value
True if the curve loop is an open curve loop consisting of lines and arcs, and false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace